NextFOAM-2506/tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/motorBike/0.orig/Ua
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            adjointInletVelocity;
        value           $internalField;
    }

    outlet
    {
        type            adjointOutletVelocity;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            adjointWallVelocity;
        value           $internalField;
    }

    motorBikeGroup
    {
          $lowerWall
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
